{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 250, 250, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 250, 250, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [107648, 500], "dtype": "float32"}, {"name": "dense/bias", "shape": [500], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [500, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}]}]}